InformationRegisters/СоответствиеТНВЭДиОКПД2ИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеТНВЭДиОКПД2ИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Изменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТНВЭДПоВидамПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОКПД2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОКПД2ПоВидамПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоответствиеТНВЭДиОКПД2ИС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ПриЗагрузкеКлассификатора(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления) Экспорт
	
	Блокировка = Новый БлокировкаДанных();
	Блокировка.Добавить(Метаданные.РегистрыСведений.СоответствиеТНВЭДиОКПД2ИС.ПолноеИмя());
	
	Попытка
		Блокировка.Заблокировать();
		ОбновитьСоответствиеТНВЭДИОКПД2Классификатора(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления);
		
	Исключение
		ТекстОшибкиПодробно = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		РезультатОбновления.СообщениеОбОшибке = ТекстОшибкиПодробно;
		РезультатОбновления.УспешнаяЗагрузка  = Ложь;
		
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьСоответствиеТНВЭДИОКПД2Классификатора(ДанныеКлассификатора, ПараметрыЗагрузки, РезультатОбновления)
	
	Идентификаторы           = ПараметрыЗагрузки.Идентификаторы;
	ДанныеКЗагрузке          = ДанныеКлассификатора.СоответствиеТНВЭДОКПД2;
	ЗагрузкаИзменений        = ПараметрыЗагрузки.ЗагрузкаИзменений;
	ИмяТаблицыКодовТНВЭД     = Метаданные.Справочники.ТНВЭДПоВидамПродукцииИС.ПолноеИмя();
	ИмяТаблицыКодовОКПД2     = Метаданные.Справочники.ОКПД2ПоВидамПродукцииИС.ПолноеИмя();
	ИмяТаблицыВидовПродукции = Метаданные.Справочники.ВидыПродукцииИС.ПолноеИмя();
	
	ТаблицаКЗагрузке = Новый ТаблицаЗначений;
	ТаблицаКЗагрузке.Колонки.Добавить("ТНВЭД",           Новый ОписаниеТипов("СправочникСсылка.ТНВЭДПоВидамПродукцииИС"));
	ТаблицаКЗагрузке.Колонки.Добавить("ОКПД2",           Новый ОписаниеТипов("СправочникСсылка.ОКПД2ПоВидамПродукцииИС"));
	ТаблицаКЗагрузке.Колонки.Добавить("Изменен",         Новый ОписаниеТипов("Булево"));
	ТаблицаКЗагрузке.Колонки.Добавить("ПометкаУдаления", Новый ОписаниеТипов("Булево"));
	
	ТаблицаПодбораТНВЭДОКПД = Новый ТаблицаЗначений;
	ТаблицаПодбораТНВЭДОКПД.Колонки.Добавить("ТНВЭДИдентификатор",             ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ТаблицаПодбораТНВЭДОКПД.Колонки.Добавить("ОКПД2Идентификатор",             ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ТаблицаПодбораТНВЭДОКПД.Колонки.Добавить("Изменен",                        Новый ОписаниеТипов("Булево"));
	ТаблицаПодбораТНВЭДОКПД.Колонки.Добавить("ПометкаУдаления",                Новый ОписаниеТипов("Булево"));
	ТаблицаПодбораТНВЭДОКПД.Колонки.Добавить("ТНВЭДКод",                       ОбщегоНазначения.ОписаниеТипаСтрока(10));
	ТаблицаПодбораТНВЭДОКПД.Колонки.Добавить("ТНВЭДВидПродукцииИдентификатор", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ТаблицаПодбораТНВЭДОКПД.Колонки.Добавить("ТНВЭДВидПродукцииНаименование",  ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаПодбораТНВЭДОКПД.Колонки.Добавить("ОКПД2Код",                       ОбщегоНазначения.ОписаниеТипаСтрока(12));
	ТаблицаПодбораТНВЭДОКПД.Колонки.Добавить("ОКПД2ВидПродукцииИдентификатор", ОбщегоНазначения.ОписаниеТипаСтрока(36));
	ТаблицаПодбораТНВЭДОКПД.Колонки.Добавить("ОКПД2ВидПродукцииНаименование",  ОбщегоНазначения.ОписаниеТипаСтрока(150));
	
	Если Не ПараметрыЗагрузки.ЗагрузкаИзменений Тогда
		Для Каждого СтрокаКЗагрузке Из ДанныеКЗагрузке Цикл
			ЗаполнитьЗначенияСвойств(ТаблицаПодбораТНВЭДОКПД.Добавить(), СтрокаКЗагрузке);
		КонецЦикла;
		
	Иначе
		Для Каждого СтрокаКЗагрузке Из ДанныеКЗагрузке Цикл
			Если ЗначениеЗаполнено(СтрокаКЗагрузке.ТНВЭДИдентификатор) И ЗначениеЗаполнено(СтрокаКЗагрузке.ОКПД2Идентификатор) Тогда
				ЗаполнитьЗначенияСвойств(ТаблицаПодбораТНВЭДОКПД.Добавить(), СтрокаКЗагрузке);
				Продолжить;
			КонецЕсли;
			
			СтруктураПодбора = ИнициализироватьПараметрыПодбораЗначенийВТаблицеИдентификаторов();
			
			СтруктураПодбора.Идентификатор             = СтрокаКЗагрузке.ТНВЭДИдентификатор;
			СтруктураПодбора.Код                       = СтрокаКЗагрузке.ТНВЭДКод;
			СтруктураПодбора.ВидПродукцииИдентификатор = СтрокаКЗагрузке.ТНВЭДВидПродукцииИдентификатор;
			СтруктураПодбора.ВидПродукцииНаименование  = СтрокаКЗагрузке.ТНВЭДВидПродукцииНаименование;
			
			НайденныеСтроки = ПодборЗначенийВТаблицеИдентификаторов(Идентификаторы, ИмяТаблицыКодовТНВЭД,
				ИмяТаблицыВидовПродукции, СтруктураПодбора);
			
			Если НайденныеСтроки <> Неопределено И НайденныеСтроки.Количество() Тогда
				КодТНВЭДСсылка = НайденныеСтроки[0].Ссылка;
			Иначе
				РезультатОбновления.ДанныеЗагруженыЧастично = Истина;
				Продолжить;
			КонецЕсли;
			
			СтруктураПодбора = ИнициализироватьПараметрыПодбораЗначенийВТаблицеИдентификаторов();
			
			СтруктураПодбора.Идентификатор             = СтрокаКЗагрузке.ОКПД2Идентификатор;
			СтруктураПодбора.Код                       = СтрокаКЗагрузке.ОКПД2Код;
			СтруктураПодбора.ВидПродукцииИдентификатор = СтрокаКЗагрузке.ОКПД2ВидПродукцииИдентификатор;
			СтруктураПодбора.ВидПродукцииНаименование  = СтрокаКЗагрузке.ОКПД2ВидПродукцииНаименование;
			
			НайденныеСтроки = ПодборЗначенийВТаблицеИдентификаторов(Идентификаторы, ИмяТаблицыКодовОКПД2, 
				ИмяТаблицыВидовПродукции, СтруктураПодбора);
			
			Если НайденныеСтроки <> Неопределено И НайденныеСтроки.Количество() Тогда
				КодОКПД2Ссылка = НайденныеСтроки[0].Ссылка;
			Иначе
				РезультатОбновления.ДанныеЗагруженыЧастично = Истина;
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаКЗагрузке.Добавить();
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаКЗагрузке);
			
			НоваяСтрока.ТНВЭД = КодТНВЭДСсылка;
			НоваяСтрока.ОКПД2 = КодОКПД2Ссылка;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВтПоискПоИдентификатору.ТНВЭДИдентификатор КАК ТНВЭДИдентификатор,
		|	ВтПоискПоИдентификатору.ОКПД2Идентификатор КАК ОКПД2Идентификатор,
		|	ВтПоискПоИдентификатору.Изменен КАК Изменен,
		|	ВтПоискПоИдентификатору.ПометкаУдаления КАК ПометкаУдаления,
		|	ВтПоискПоИдентификатору.ТНВЭДКод КАК ТНВЭДКод,
		|	ВтПоискПоИдентификатору.ТНВЭДВидПродукцииИдентификатор КАК ТНВЭДВидПродукцииИдентификатор,
		|	ВтПоискПоИдентификатору.ТНВЭДВидПродукцииНаименование КАК ТНВЭДВидПродукцииНаименование,
		|	ВтПоискПоИдентификатору.ОКПД2Код КАК ОКПД2Код,
		|	ВтПоискПоИдентификатору.ОКПД2ВидПродукцииИдентификатор КАК ОКПД2ВидПродукцииИдентификатор,
		|	ВтПоискПоИдентификатору.ОКПД2ВидПродукцииНаименование КАК ОКПД2ВидПродукцииНаименование
		|ПОМЕСТИТЬ ВтИдентификаторы
		|ИЗ
		|	&ВтПоискПоИдентификатору КАК ВтПоискПоИдентификатору
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ОКПД2ПоВидамПродукцииИС.Ссылка, НЕОПРЕДЕЛЕНО) КАК ОКПД2,
		|	ЕСТЬNULL(ТНВЭДПоВидамПродукцииИС.Ссылка, НЕОПРЕДЕЛЕНО) КАК ТНВЭД,
		|	ВтИдентификаторы.Изменен КАК Изменен,
		|	ВтИдентификаторы.ПометкаУдаления КАК ПометкаУдаления,
		|	ВтИдентификаторы.ТНВЭДИдентификатор КАК ТНВЭДИдентификатор,
		|	ВтИдентификаторы.ОКПД2Идентификатор КАК ОКПД2Идентификатор,
		|	ВтИдентификаторы.ТНВЭДКод КАК ТНВЭДКод,
		|	ВтИдентификаторы.ТНВЭДВидПродукцииИдентификатор КАК ТНВЭДВидПродукцииИдентификатор,
		|	ВтИдентификаторы.ТНВЭДВидПродукцииНаименование КАК ТНВЭДВидПродукцииНаименование,
		|	ВтИдентификаторы.ОКПД2Код КАК ОКПД2Код,
		|	ВтИдентификаторы.ОКПД2ВидПродукцииИдентификатор КАК ОКПД2ВидПродукцииИдентификатор,
		|	ВтИдентификаторы.ОКПД2ВидПродукцииНаименование КАК ОКПД2ВидПродукцииНаименование
		|ИЗ
		|	ВтИдентификаторы КАК ВтИдентификаторы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТНВЭДПоВидамПродукцииИС КАК ТНВЭДПоВидамПродукцииИС
		|		ПО ВтИдентификаторы.ТНВЭДИдентификатор = ТНВЭДПоВидамПродукцииИС.Идентификатор
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОКПД2ПоВидамПродукцииИС КАК ОКПД2ПоВидамПродукцииИС
		|		ПО ВтИдентификаторы.ОКПД2Идентификатор = ОКПД2ПоВидамПродукцииИС.Идентификатор";
	Запрос.УстановитьПараметр("ВтПоискПоИдентификатору", ТаблицаПодбораТНВЭДОКПД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КодТНВЭДСсылка = ВыборкаДетальныеЗаписи.ТНВЭД;
		КодОКПД2Ссылка = ВыборкаДетальныеЗаписи.ОКПД2;
		
		Если КодТНВЭДСсылка = Неопределено Тогда
			СтруктураПодбора = ИнициализироватьПараметрыПодбораЗначенийВТаблицеИдентификаторов();
			
			СтруктураПодбора.Идентификатор             = ВыборкаДетальныеЗаписи.ТНВЭДИдентификатор;
			СтруктураПодбора.Код                       = ВыборкаДетальныеЗаписи.ТНВЭДКод;
			СтруктураПодбора.ВидПродукцииИдентификатор = ВыборкаДетальныеЗаписи.ТНВЭДВидПродукцииИдентификатор;
			СтруктураПодбора.ВидПродукцииНаименование  = ВыборкаДетальныеЗаписи.ТНВЭДВидПродукцииНаименование;
			
			НайденныеСтроки = ПодборЗначенийВТаблицеИдентификаторов(Идентификаторы, ИмяТаблицыКодовТНВЭД, ИмяТаблицыВидовПродукции, СтруктураПодбора);
			
			Если НайденныеСтроки <> Неопределено И НайденныеСтроки.Количество() Тогда
				КодТНВЭДСсылка = НайденныеСтроки[0].Ссылка;
			Иначе
				РезультатОбновления.ДанныеЗагруженыЧастично = Истина;
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если КодОКПД2Ссылка = Неопределено Тогда
			СтруктураПодбора = ИнициализироватьПараметрыПодбораЗначенийВТаблицеИдентификаторов();
			
			СтруктураПодбора.Идентификатор             = ВыборкаДетальныеЗаписи.ОКПД2Идентификатор;
			СтруктураПодбора.Код                       = ВыборкаДетальныеЗаписи.ОКПД2Код;
			СтруктураПодбора.ВидПродукцииИдентификатор = ВыборкаДетальныеЗаписи.ОКПД2ВидПродукцииИдентификатор;
			СтруктураПодбора.ВидПродукцииНаименование  = ВыборкаДетальныеЗаписи.ОКПД2ВидПродукцииНаименование;
			
			НайденныеСтроки = ПодборЗначенийВТаблицеИдентификаторов(Идентификаторы, ИмяТаблицыКодовОКПД2, ИмяТаблицыВидовПродукции, СтруктураПодбора);
			
			Если НайденныеСтроки <> Неопределено И НайденныеСтроки.Количество() Тогда
				КодОКПД2Ссылка = НайденныеСтроки[0].Ссылка;
			Иначе
				РезультатОбновления.ДанныеЗагруженыЧастично = Истина;
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		СтрокаТаблицыЗагрузки = ТаблицаКЗагрузке.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыЗагрузки, ВыборкаДетальныеЗаписи, "Изменен, ПометкаУдаления");
		
		СтрокаТаблицыЗагрузки.ТНВЭД = КодТНВЭДСсылка;
		СтрокаТаблицыЗагрузки.ОКПД2 = КодОКПД2Ссылка;
		
	КонецЦикла;
	
	Если ЗагрузкаИзменений Тогда
		Для Каждого СтрокаИзменений Из ТаблицаКЗагрузке Цикл
			ЗаписьТНВЭДОКПД2 = СоздатьМенеджерЗаписи();
			ЗаписьТНВЭДОКПД2.ТНВЭД = СтрокаИзменений.ТНВЭД;
			ЗаписьТНВЭДОКПД2.ОКПД2 = СтрокаИзменений.ОКПД2;
			
			ЗаписьТНВЭДОКПД2.Прочитать();
			
			ЗаполнитьЗначенияСвойств(ЗаписьТНВЭДОКПД2, СтрокаИзменений);
			
			ЗаписьТНВЭДОКПД2.Записать();
			
		КонецЦикла;

	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ТаблицаКЗагрузке.ТНВЭД КАК ТНВЭД,
		|	ТаблицаКЗагрузке.ОКПД2 КАК ОКПД2,
		|	ТаблицаКЗагрузке.Изменен КАК Изменен,
		|	ТаблицаКЗагрузке.ПометкаУдаления КАК ПометкаУдаления
		|ПОМЕСТИТЬ втЗагружаемыеДанные
		|ИЗ
		|	&ТаблицаКЗагрузке КАК ТаблицаКЗагрузке
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СоответствиеТНВЭДиОКПД2ИС.ТНВЭД, НЕОПРЕДЕЛЕНО) КАК ТНВЭД,
		|	СоответствиеТНВЭДиОКПД2ИС.ОКПД2 КАК ОКПД2,
		|	ЕСТЬNULL(втЗагружаемыеДанные.ТНВЭД, НЕОПРЕДЕЛЕНО) КАК ТНВЭДПоставляемый,
		|	втЗагружаемыеДанные.ОКПД2 КАК ОКПД2Поставляемый,
		|	втЗагружаемыеДанные.Изменен КАК ИзмененПоставляемый,
		|	втЗагружаемыеДанные.ПометкаУдаления КАК ПометкаУдаленияПоставляемый,
		|	СоответствиеТНВЭДиОКПД2ИС.Изменен,
		|	СоответствиеТНВЭДиОКПД2ИС.ПометкаУдаления
		|ИЗ
		|	РегистрСведений.СоответствиеТНВЭДиОКПД2ИС КАК СоответствиеТНВЭДиОКПД2ИС
		|		ПОЛНОЕ СОЕДИНЕНИЕ втЗагружаемыеДанные КАК втЗагружаемыеДанные
		|		ПО СоответствиеТНВЭДиОКПД2ИС.ТНВЭД = втЗагружаемыеДанные.ТНВЭД
		|		И СоответствиеТНВЭДиОКПД2ИС.ОКПД2 = втЗагружаемыеДанные.ОКПД2";
		Запрос.УстановитьПараметр("ТаблицаКЗагрузке", ТаблицаКЗагрузке);

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		НаборЗаписей = СоздатьНаборЗаписей();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.ТНВЭД = Неопределено Тогда
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.ТНВЭД           = ВыборкаДетальныеЗаписи.ТНВЭДПоставляемый;
				НоваяЗапись.ОКПД2           = ВыборкаДетальныеЗаписи.ОКПД2Поставляемый;
				НоваяЗапись.Изменен         = ВыборкаДетальныеЗаписи.ИзмененПоставляемый;
				НоваяЗапись.ПометкаУдаления = ВыборкаДетальныеЗаписи.ПометкаУдаленияПоставляемый;
			Иначе
				Если ВыборкаДетальныеЗаписи.ТНВЭДПоставляемый = Неопределено Тогда
					Если ВыборкаДетальныеЗаписи.Изменен И Не ВыборкаДетальныеЗаписи.ПометкаУдаления Тогда
						НоваяЗапись = НаборЗаписей.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаДетальныеЗаписи);
					ИначеЕсли ВыборкаДетальныеЗаписи.Изменен И ВыборкаДетальныеЗаписи.ПометкаУдаления Тогда
						Продолжить;
					КонецЕсли;
				Иначе
					НоваяЗапись = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаДетальныеЗаписи);
					Если ВыборкаДетальныеЗаписи.Изменен И Не ВыборкаДетальныеЗаписи.ПометкаУдаления Тогда
						НоваяЗапись.Изменен = Ложь;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

		НаборЗаписей.Записать();

    КонецЕсли;
    
КонецПроцедуры

Функция ИнициализироватьПараметрыОбновления() Экспорт
	
	СтруктураДанныхОбновления = Новый Структура;
	
	СтруктураДанныхОбновления.Вставить("ТНВЭДКод",                       "");
	СтруктураДанныхОбновления.Вставить("ТНВЭДИдентификатор",             "");
	СтруктураДанныхОбновления.Вставить("ТНВЭДВидПродукцииИдентификатор", "");
	СтруктураДанныхОбновления.Вставить("ТНВЭДВидПродукцииНаименование",  "");
	СтруктураДанныхОбновления.Вставить("ОКПД2Код",                       "");
	СтруктураДанныхОбновления.Вставить("ОКПД2Идентификатор",             "");
	СтруктураДанныхОбновления.Вставить("ОКПД2ВидПродукцииИдентификатор", "");
	СтруктураДанныхОбновления.Вставить("ОКПД2ВидПродукцииНаименование",  "");
	
	Возврат СтруктураДанныхОбновления;
	
КонецФункции

Функция ПодборЗначенийВТаблицеИдентификаторов(Идентификаторы, ИмяТаблицы, ИмяТаблицыВидовПродукции, СтруктураПодбора)
	
	НайденныеСтроки = Неопределено;
	ПрерватьПодбор  = Ложь;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ИмяТаблицы",    ИмяТаблицы);
	СтруктураПоиска.Вставить("Идентификатор", СтруктураПодбора.Идентификатор);
	
	Если Не ЗначениеЗаполнено(СтруктураПодбора.Идентификатор) Тогда
		СтруктураПоискаВидаПродукции = Новый Структура;
		СтруктураПоискаВидаПродукции.Вставить("ИмяТаблицы",    ИмяТаблицыВидовПродукции);
		СтруктураПоискаВидаПродукции.Вставить("Идентификатор", СтруктураПодбора.ВидПродукцииИдентификатор);
		СтруктураПоискаВидаПродукции.Вставить("Наименование",  СтруктураПодбора.ВидПродукцииНаименование);
		
		НайденныеСтрокиВидаПродукции = Идентификаторы.НайтиСтроки(СтруктураПоискаВидаПродукции);
		
		Если НайденныеСтрокиВидаПродукции.Количество() Тогда
			ВидПродукцииСсылка = НайденныеСтрокиВидаПродукции[0].Ссылка;
			
			СоставКлюча = Новый СписокЗначений;
			СоставКлюча.Добавить(СтруктураПодбора.Код);
			СоставКлюча.Добавить(ВидПродукцииСсылка);
			СоставКлюча.СортироватьПоЗначению();
			
			СтруктураПоиска.Вставить("КлючЗначения", ОбщегоНазначенияИС.ХэшСуммаСтроки(СтрСоединить(
			СоставКлюча.ВыгрузитьЗначения())));
			
		Иначе
			ПрерватьПодбор = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ПрерватьПодбор Тогда
		НайденныеСтроки = Идентификаторы.НайтиСтроки(СтруктураПоиска);
	КонецЕсли;
	
	Возврат НайденныеСтроки;
	
КонецФункции

Функция ИнициализироватьПараметрыПодбораЗначенийВТаблицеИдентификаторов()
	
	СтруктураПодбора = Новый Структура;
	СтруктураПодбора.Вставить("Идентификатор",             "");
	СтруктураПодбора.Вставить("Код",                       "");
	СтруктураПодбора.Вставить("ВидПродукцииИдентификатор", "");
	СтруктураПодбора.Вставить("ВидПродукцииНаименование",  "");
	
	Возврат СтруктураПодбора;
	
КонецФункции

#КонецОбласти

#КонецЕсли
